<?php
namespace models;
// ეს არის მოდელის კლასი
//აქ უნდა მოხდეს მონაცემთა ბაზასთან დაკავშირება
//და შესაბამისი ლოგიკების გაწერა.
class Main
{
    public function __construct()
    {
    }

    // ეს სატესტუ ფუნქცია უკან დააბრუნებს მომხმარებლის კლასს სტუმარია თუ მომხმარებელი.
    public function get_user_from_DB($user_id)
    {
        //სატესტო მონაცემთა ბაზა
        $DB = [
            0 => 'Guest',
            1 => 'User'
        ];

        //ბაზაში შემოწმება თუ არსებობს ეს რიცხვი, თუ არა სტუმარია,
        if (!isset($DB[$user_id])) return 'Guest';

        // თუ არსებობს შესაბამის მონაცემს დააბრუნებს.
        return $DB[$user_id];
    }
}
